{"class_name": "Model", "keras_version": "2.1.3", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 4, 100, 1], "name": "input_4", "sparse": false}, "inbound_nodes": [], "name": "input_4"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_4", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "data_format": "channels_first", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "conv2d_4"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_4"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "flatten_4"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["flatten_4", 0, 0, {}]]], "name": "dense_4"}], "input_layers": [["input_4", 0, 0]], "output_layers": [["dense_4", 0, 0]], "name": "model_4"}, "backend": "tensorflow"}